rack/app/controllers/api/v1/services/urls_controller.rb

  def create
#    @url = Url.new(short_url_hash: "234234", original_url: params[:url])
    update_url && url

    if @url.save
---
INSERT INTO `urls` (`original_url`, `short_url_hash`, `created_at`, `updated_at`) VALUES ('https://www.gawin.ph', 'testHash', '2019-05-31 04:35:40', '2019-05-31 04:35:40')