rack/app/controllers/urls_controller.rb

  def show
    url = Url.find_by(short_url_hash: params[:id])
    if url&.original_url.present?
---
SELECT  `urls`.* FROM `urls` WHERE `urls`.`short_url_hash` = '1' LIMIT 1
SELECT `urls`.* FROM `urls`